app/controllers/historys_controller.rb

INSERT INTO "histories" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 18], ["created_at", "2017-10-18 04:56:50.030194"], ["updated_at", "2017-10-18 04:56:50.030194"]]
---
  def create
    @history = History.new(history_params)
    @history.user = current_user
    @history.save